<a href="https://colab.research.google.com/github/vikramviky123/pySpark/blob/main/Pyspark_ch_2_SparkPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
## Importing Basic necessary libraries
import pandas as pd
import numpy as np

import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

In [2]:
import warnings
warnings.filterwarnings('ignore')

In [3]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [4]:
pip install pyspark

Collecting pyspark
  Downloading pyspark-3.5.0.tar.gz (316.9 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 316.9/316.9 MB 2.5 MB/s eta 0:00:00
  Preparing metadata (setup.py) ... done
Requirement already satisfied: py4j==0.10.9.7 in /usr/local/lib/python3.10/dist-packages (from pyspark) (0.10.9.7)
Building wheels for collected packages: pyspark
  Building wheel for pyspark (setup.py) ... done
  Created wheel for pyspark: filename=pyspark-3.5.0-py2.py3-none-any.whl size=317425344 sha256=4ae1f88285dc70f5f1a3b44af56ecb41c1a07527320277fd9db7818b009a6b0b
  Stored in directory: /root/.cache/pip/wheels/41/4e/10/c2cf2467f71c678cfc8a6b9ac9241e5e44a01940da8fbb17fc
Successfully built pyspark
Installing collected packages: pyspark
Successfully installed pyspark-3.5.0

## DataFrame & SparkSession

In [28]:
## creating a spark session
from pyspark.sql import SparkSession
spark = SparkSession.builder.appName('tutorial').getOrCreate()

In [29]:
spark

In [30]:
import pyspark.pandas as pp

In [31]:
path = '/content/drive/MyDrive/PYSPARK/Titanic.csv'

In [32]:
df = pp.read_csv(path)

In [33]:
df.head()

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  None        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85        C
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  None        S
3            4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S
4            5         0       3                             Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500  None        S

In [34]:
type(df)

pyspark.pandas.frame.DataFrame

In [35]:
df.info()

<class 'pyspark.pandas.frame.DataFrame'>
Int64Index: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int32
 1   Survived     891 non-null    int32
 2   Pclass       891 non-null    int32
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int32
 7   Parch        891 non-null    int32
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int32(5), object(5)

In [46]:
df.shape, df.size, df.ndim,df.isnull().sum().sum()

((891, 12), 10692, 2, 866)

In [37]:
df.describe()

       PassengerId    Survived      Pclass         Age       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%     223.000000    0.000000    2.000000   20.000000    0.000000    0.000000    7.895800
50%     446.000000    0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%     669.000000    1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [40]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [39]:
df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [45]:
dff = df.copy()
dff.pop("Embarked")
dff.head()

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  None
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  None
3            4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123
4            5         0       3                             Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500  None

In [55]:
cols = ["Age", "Fare"]
df[cols].idxmax(axis = 0)

Age     630
Fare    258
dtype: int64

In [24]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [57]:
df["Age"].plot.box()

## Columns

In [60]:
df.sort_values(by="Age", ascending=False).head()

     PassengerId  Survived  Pclass                                  Name   Sex   Age  SibSp  Parch    Ticket     Fare Cabin Embarked
630          631         1       1  Barkworth, Mr. Algernon Henry Wilson  male  80.0      0      0     27042  30.0000   A23        S
851          852         0       3                   Svensson, Mr. Johan  male  74.0      0      0    347060   7.7750  None        S
96            97         0       1             Goldschmidt, Mr. George B  male  71.0      0      0  PC 17754  34.6542    A5        C
493          494         0       1               Artagaveytia, Mr. Ramon  male  71.0      0      0  PC 17609  49.5042  None        C
116          117         0       3                  Connors, Mr. Patrick  male  70.5      0      0    370369   7.7500  None        Q

In [65]:
df["Log_Age"] = df["Age"].apply(np.log)
display(df.head())
df.pop("Log_Age")
df.head()

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked   Log_Age
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  None        S  3.091042
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85        C  3.637586
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  None        S  3.258097
3            4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S  3.555348
4            5         0       3                             Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500  None        S  3.555348

   PassengerId  Survived  Pclass                                                 Name     Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0            1         0       3                              Braund, Mr. Owen Harris    male  22.0      1      0         A/5 21171   7.2500  None        S
1            2         1       1  Cumings, Mrs. John Bradley (Florence Briggs Thayer)  female  38.0      1      0          PC 17599  71.2833   C85        C
2            3         1       3                               Heikkinen, Miss. Laina  female  26.0      0      0  STON/O2. 3101282   7.9250  None        S
3            4         1       1         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0            113803  53.1000  C123        S
4            5         0       3                             Allen, Mr. William Henry    male  35.0      0      0            373450   8.0500  None        S

In [ ]:
df.select(df.Cabin.isNull()).show(3)

## Functions

In [ ]:
from pyspark.sql import functions as F

In [ ]:
df.select(F.col("Age")).show(3)

In [ ]:
df.select(F.lit(5).alias('AGE'), df.Age).show(2)

In [ ]:
df.groupby("Cabin").agg(F.mode("Age")\
                   .alias("Mode_Age"))\
                    .dropna(how = "any")\
                    .sort("Mode_age", ascending = False)\
                    .show(2)

In [ ]:
df.select("Cabin", F.isnull(df.Cabin).alias("Cabin_chk")).show(5)

In [ ]:
df.select(F.when(df['Age'] >30,50).otherwise(df['Age']).alias("new_age")).show(2)

In [ ]:
df.agg({"Age":"sum"}).show()
df.select(F.sum("Age").alias("Total_Sum")).show()
df.groupBy("Sex").agg({"Age":"sum"}).show()
df.groupBy("Sex").sum().show()

In [ ]:
print(df.select(F.sqrt(df.Age)).show(2))
print(df.select(F.sum(df.Age),F.format_number(F.mean(df.Age),2),F.max(df.Age),F.min(df.Age),F.median(df.Age),F.count(df.Age)).show())
print(df.select(F.first_value(df.Age),F.last_value(df.Age)).show())

In [ ]:
df.select(F.upper(df.Name)).show(1)
df.select(F.substring(df.Name,1,5)).show(1)

## Group By

In [ ]:
from pyspark.sql import functions as F

In [ ]:
df.toPandas().head()

In [ ]:
df.groupBy("Sex").agg(
    F.avg("Age").alias("avg_age")
    ).show()

In [ ]:
df.groupBy("Embarked").agg(
    F.sum("Fare").alias("total_Fare"),
    F.avg("Fare").alias("average_Fare")
).show()

In [ ]:
df.groupBy("Sex", "Survived").agg(F.sum("Fare").alias("total_Fare"),F.avg("Fare").alias("avg_Fare")).show()

In [ ]:
xxd = df.groupBy("Sex").sum()
xxd.show(5)
xxd.orderBy(F.col("sum(Survived)").desc()).show()

## SQL

In [ ]:
df.createOrReplaceTempView("Titanica")

In [ ]:
sql_qry1 = "SELECT * FROM Titanica"
results = spark.sql(sql_qry1)
results.show(5)

## Date and Time

In [ ]:
dff = spark.read.csv("/content/drive/MyDrive/PYSPARK/Delhi_Pollution.csv", header =True, inferSchema=True )
dff.show(2)

In [ ]:
dff.select(F.month("Date"),
           F.year("Date"),
           F.quarter("Date"),
           F.day("Date"),
           F.dayofmonth("Date")
           ).show()